#include "ht1621b.h"


uchar Num_Addr[4] = {0x00, 0x02, 0x04, 0x06};  //lcd 4个数字的起始位置
uchar Num_Data[10] = {0xeb, 0x0a, 0xad, 0x8f, 0x4e,           //0~9
                      0xc7, 0xe7, 0x8a, 0xef, 0xcf
                      };

/*******************************************************************************
****Name:
****Func:延时函数
****Version:V1.0
****date:22-8-2017
****入口参数:无
****出口参数:无
****说明:
********************************************************************************/
void Delay_lcd(uchar us)
{
  while(--us);
}

void DelayMS(uint iMs)
{
   uint i;
   for(i=0;i<120;i++)
   {
     Delay_lcd(1);
   }
}
       
/*******************************************************************************
****Name:
****Func:端口初始化
****Version:V1.0
****date:22-8-2017
****入口参数:无
****出口参数:无
****说明:
********************************************************************************/       
void port_init(void)
{
    GPIO_Init(GPIOF, GPIO_PIN_4, GPIO_MODE_OUT_PP_LOW_FAST);
    GPIO_Init(GPIOB, GPIO_PIN_6, GPIO_MODE_OUT_PP_LOW_FAST);
    GPIO_Init(GPIOB, GPIO_PIN_7, GPIO_MODE_OUT_PP_LOW_FAST);
}

/*******************************************************************************
****Name:
****Func:lcd控制器初始化
****Version:V1.0
****date:22-8-2017
****入口参数:无
****出口参数:无
****说明:
********************************************************************************/
void Ht1621_Init(void)
{
    SET_HT_CS;
    SET_HT_WR;
    SET_HT_DAT;
    DelayMS(20); 
    Ht1621WrCmd(BIAS);
    Ht1621WrCmd(RC256); //使用内部振荡器
    Ht1621WrCmd(SYSDIS);
    Ht1621WrCmd(WDTDIS);
    Ht1621WrCmd(SYSEN);
    Ht1621WrCmd(LCDON);
    DelayMS(20); 
    Ht1621WrAllData();
}
/*******************************************************************************
****Name:
****Func:按照原理图时序写数据
****Version:V1.0
****date:22-8-2017
****入口参数:无
****出口参数:无
****说明:
********************************************************************************/
void Ht1621Wr_Data(uchar Data,uchar cnt)
{
    uchar i;
    for(i=0; i<cnt; i++)
    {
      CLS_HT_WR; 
      DelayMS(3); 
      if((Data & 0x80)==0x80)
      {
         SET_HT_DAT; 
      }
      else
      {
         CLS_HT_DAT; 
      }
      SET_HT_WR;   
      DelayMS(3); 
      Data<<=1;
    }
}       
/*******************************************************************************
****Name:
****Func:写入命令
****Version:V1.0
****date:22-8-2017
****入口参数:无
****出口参数:无
****说明:
********************************************************************************/             
void Ht1621WrCmd(uchar Cmd)
{
    CLS_HT_CS;
    DelayMS(1); 
    Ht1621Wr_Data(0x80,4); 
    Ht1621Wr_Data(Cmd,8); 
    SET_HT_CS;
}
/*******************************************************************************
****Name:
****Func:写入4bit数据
****Version:V1.0
****date:22-8-2017
****入口参数:无
****出口参数:无
****说明:
********************************************************************************/       

void Ht1621WrOneData(uchar Addr,uchar Data)
{
    CLS_HT_CS;  
    DelayMS(1); 
    Ht1621Wr_Data(0xa0,3); 
    Ht1621Wr_Data(Addr<<2,6); 
    Ht1621Wr_Data(Data<<4,4); 
    SET_HT_CS;
}
/*******************************************************************************
****Name:
****Func:写入8bit数据
****Version:V1.0
****date:22-8-2017
****入口参数:无
****出口参数:无
****说明:
********************************************************************************/
void Ht1621WrOneNum(uchar Addr,uchar num)
{
    CLS_HT_CS;
    Ht1621Wr_Data(0xa0,3); 
    Ht1621Wr_Data(Addr<<2,6); 
    Ht1621Wr_Data(num,8); 
    SET_HT_CS;
}

/*******************************************************************************
****Name:
****Func:清屏
****Version:V1.0
****date:22-8-2017
****入口参数:无
****出口参数:无
****说明:
********************************************************************************/

void Ht1621WrAllData(void)
{
    uchar i;
    CLS_HT_CS;
    Ht1621Wr_Data(0xa0,3); //写入数据标志101
    Ht1621Wr_Data(0x00<<2,6); //写入地址数据
    for (i=0;i<16;i++)
    {
    Ht1621Wr_Data(0x00,8); //写入数据
    }
    SET_HT_CS;
}

/*******************************************************************************
****Name:
****Func:清屏
****Version:V1.0
****date:22-8-2017
****入口参数:无
****出口参数:无
****说明:
********************************************************************************/

void Clear_Screen()
{
    Ht1621WrOneNum(0x00, 0x00);
    Ht1621WrOneNum(0x02, 0x00);
    Ht1621WrOneNum(0x04, 0x00);
    Ht1621WrOneNum(0x06, 0x00);

}

